Revit 2024 API
NavisworksParameters Enumeration
 An enumerated type listing possible "Parameter conversions" of Navisworks Exporter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Since: 2014
Syntax
C#
public enum NavisworksParameters
Visual Basic
Public Enumeration NavisworksParameters
Visual C++
public enum class NavisworksParameters
Members
Member name | Description
None |  The file exporter does not convert parameters.
Elements |  The file exporter converts parameters for all found elements.
All |  The file exporter converts parameters for all found elements, including the referenced elements. As a result, extra property tabs are available in Autodesk Navisworks.
See Also
Autodesk.Revit.DB Namespace